Tawank/BruceOS/boards/lilygo-t-embed-cc1101/sdkconfig.defaults
# LilyGO T-Embed CC1101 (ESP32-S3, ST7789 170x320 round-corner bar display).
#
# Translated from the legacy PlatformIO env (boards/lilygo-t-embed-cc1101/
# lilygo-t-embed-cc1101.ini + pins_arduino.h's T_EMBED_1101 branch in
# BrucePIO_legacy). Peripherals with no equivalent in this HAL yet (CC1101,
# W5500 ethernet, PN532, mic, RGB LED, BadUSB) are not ported.
#
# Selected via `python tools/board.py lilygo-t-embed-cc1101 build` (see
# tools/board.py), which passes this file through SDKCONFIG_DEFAULTS after
# the shared sdkconfig.defaults. The build system automatically also loads
# sdkconfig.defaults.esp32s3 if present, per ESP-IDF's target-dependent
# sdkconfig defaults rule.
CONFIG_IDF_TARGET="esp32s3"

# Board I2C bus (legacy GROVE_SDA/GROVE_SCL, also aliased SYS_I2C_SDA/
# SYS_I2C_SCL in pins_arduino.h): shared by the BQ27220 fuel gauge below.
# Not used by the display/SD/NRF24 SPI buses, so no pin conflicts.
CONFIG_BRUCE_BOARD_I2C_ENABLED=y
CONFIG_BRUCE_BOARD_I2C_SDA_GPIO=8
CONFIG_BRUCE_BOARD_I2C_SCL_GPIO=18

# Display: SPI2_HOST, ST7789 170x320 physical panel, portrait (rotation 3).
# The 170-wide panel needs a different addressable-RAM offset table than the
# 135-wide Cardputer/StickC panels (see src/Kconfig.projbuild's help text),
# taken from TFT_eSPI's own ST7789_Rotation.h table for TFT_WIDTH==170.
CONFIG_BRUCE_DISPLAY_WIDTH=170
CONFIG_BRUCE_DISPLAY_HEIGHT=320
CONFIG_BRUCE_DISPLAY_DEFAULT_ROTATION=3
CONFIG_BRUCE_DISPLAY_SPI_HOST=1
CONFIG_BRUCE_DISPLAY_PIN_MOSI=9
CONFIG_BRUCE_DISPLAY_PIN_SCK=11
CONFIG_BRUCE_DISPLAY_PIN_CS=41
CONFIG_BRUCE_DISPLAY_PIN_DC=16
CONFIG_BRUCE_DISPLAY_PIN_RST=40
CONFIG_BRUCE_DISPLAY_PIN_BL=21
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION0=35
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION0=0
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION1=0
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION1=35
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION2=35
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION2=0
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION3=0
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION3=35

# Audio: I2S DAC (NS4168 amp). LRCLK/WS shares GPIO40 with the display reset
# line above; this matches the legacy pins_arduino.h exactly (display reset
# only pulses once at boot, before I2S ever drives the pin).
CONFIG_BRUCE_AUDIO_BACKEND_I2S=y
CONFIG_BRUCE_AUDIO_I2S_BCLK_GPIO=46
CONFIG_BRUCE_AUDIO_I2S_DATA_GPIO=7
CONFIG_BRUCE_AUDIO_I2S_LRCLK_GPIO=40

# Battery: BQ27220 fuel gauge, read over the board I2C bus above (legacy
# BQ27220_I2C_ADDRESS 0x55).
CONFIG_BRUCE_BATTERY_ENABLED=y
CONFIG_BRUCE_BATTERY_BACKEND_BQ27220=y
CONFIG_BRUCE_BATTERY_BQ27220_I2C_ADDR=0x55

# SD card: shares the SPI3_HOST radio bus (same pins as NRF24 below).
CONFIG_BRUCE_SD_ENABLED=y
CONFIG_BRUCE_SD_SPI_HOST=2
CONFIG_BRUCE_SD_PIN_MOSI=9
CONFIG_BRUCE_SD_PIN_MISO=10
CONFIG_BRUCE_SD_PIN_SCK=11
CONFIG_BRUCE_SD_PIN_CS=13

# Buttons: this board's primary input is a rotary encoder (turn + press,
# legacy ENCODER_INA/INB/KEY) plus a back button (legacy BK_BTN). The
# encoder's center press (legacy ENCODER_KEY/SEL_BTN) becomes SELECT
# (OK/confirm); the back button becomes button A. Turn motion is handled by
# the Rotary encoder section below.
CONFIG_BRUCE_BUTTON_SELECT_ENABLED=y
CONFIG_BRUCE_BUTTON_SELECT_GPIO=0
CONFIG_BRUCE_BUTTON_A_ENABLED=y
CONFIG_BRUCE_BUTTON_A_GPIO=6
# CONFIG_BRUCE_BUTTON_B_ENABLED is not set
# CONFIG_BRUCE_BUTTON_C_ENABLED is not set

# No GPIO matrix keyboard on this board.
# CONFIG_BRUCE_KEYBOARD_ENABLED is not set

# Rotary encoder: quadrature turn (legacy ENCODER_INA/INB), synthesized as
# UP/DOWN presses (see BRUCE_ENCODER_ENABLED's help text) - every existing
# menu that already handles up/down navigation works here with no app-side
# changes. The center-press part is the SELECT button above, not here.
CONFIG_BRUCE_ENCODER_ENABLED=y
CONFIG_BRUCE_ENCODER_PIN_A=4
CONFIG_BRUCE_ENCODER_PIN_B=5

# Infrared.
CONFIG_BRUCE_IR_TX_GPIO=2
CONFIG_BRUCE_IR_RX_GPIO=1

# NRF24: shares the SPI3_HOST radio bus (same pins as the SD card above).
CONFIG_BRUCE_NRF24_SCK_GPIO=11
CONFIG_BRUCE_NRF24_MISO_GPIO=10
CONFIG_BRUCE_NRF24_MOSI_GPIO=9
CONFIG_BRUCE_NRF24_CS_GPIO=44
CONFIG_BRUCE_NRF24_CE_GPIO=43
